app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."availability" = ?  [["availability", "t"]]
---
  def index
    @books = Book.where(availability: true)

INSERT INTO "books" ("name", "author", "description", "price", "availability", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "resource_file_name", "resource_content_type", "resource_file_size", "resource_updated_at", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = current_user.books.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "availability" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["availability", "f"], ["updated_at", "2017-05-18 02:47:12.668963"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)