app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @cards = Card.all

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_card
      @card = Card.find(params[:id])